___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="CLRSWY"></p>

___

<h1><p style="text-align: center;">Pandas Lesson, Session - 5</p><h1>

# Aggregation & Groupby

The ``groupby`` method allows you to group rows of data together and call aggregate functions

### Basic aggregation methods:

* ``count()``
* ``mean()``
* ``median()``
* ``min()``
* ``max()``
* ``std()``
* ``var()``
* ``sum()``

In [1]:
import seaborn as sns
import pandas as pd
import numpy as np

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

(1035, 6)

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [369]:
df["mass"].mean()

2.6381605847953233

513

In [380]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

 - # ``df.groupby()``

In [385]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: method, dtype: int64

In [396]:
df.groupby("method")[["orbital_period"]].mean()

                               orbital_period
method
Astrometry                         631.180000
Eclipse Timing Variations         4751.644444
Imaging                         118247.737500
Microlensing                      3153.571429
Orbital Brightness Modulation        0.709307
Pulsar Timing                     7343.021201
Pulsation Timing Variations       1170.000000
Radial Velocity                    823.354680
Transit                             21.102073
Transit Timing Variations           79.783500

In [403]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales':[200, 120, 340, 124, 243, 350]}

In [404]:
df1 = pd.DataFrame(data)

In [405]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

**Now you can use the ``.groupby()`` method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

You can save this object as a new variable:

And then call aggregate methods off the object:

More examples of aggregate methods:

 - # ``DataFrame`` Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show **Common Operations** here in this lecture:

- Quick review and refresh

In [572]:
df2 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df2.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [573]:
app = df2.loc[:,['col1']]
app

   col1
0     1
1     2
2     3
3     4

### Selecting Data

In [578]:
#Select from DataFrame using criteria from multiple columns

In [579]:
newdf

   col1  col2 col3
3     4   444  xyz

10

**Permanently Removing a Column**

In [581]:
#df2.drop('col1',axis=1,inplace=True)

**Get column and index names:**

Index(['col1', 'col2', 'col3'], dtype='object')

RangeIndex(start=0, stop=4, step=1)

**Sorting and Ordering a DataFrame:**

In [586]:
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [2]:

# inplace=False by default

**Find Null Values or Check for Null Values**

In [588]:

#df2.isna()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [590]:
df2

   col1  col2 col3
0   1.0   444  abc
1   2.0   555  def
2   NaN   666  ghi
3   4.0   444  xyz

In [591]:
# Drop rows with NaN Values

   col1  col2 col3
0   1.0   444  abc
1   2.0   555  def
3   4.0   444  xyz

**Filling in NaN values with something else:**

In [592]:
df3 = pd.DataFrame({'col1':[1, 2, 3, np.nan],
                   'col2':[np.nan, 555, 666, 444],
                   'col3':['abc', 'def', 'ghi', 'xyz']})
df3.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

**Map / Replace**

In [598]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales':[200, 120, 340, 124, 243, 350]}

In [599]:
df4=pd.DataFrame(data)

In [601]:
df4

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [606]:
df_m['Sales']=df_m.Sales.map(lambda x: x*1000)
df_m

  Company   Person   Sales
0     GOO      Sam  200000
1     GOO  Charlie  120000
2     MIC      Amy  340000
3     MIC  Vanessa  124000
4    FACE     Carl  243000
5    FACE    Sarah  350000

**Duplicate / Between**

In [612]:
dup_df = pd.DataFrame([5,5,6,7,8,8,7,12,25,55,25],['a','b','c','d','e','f','g','h','i','j','k'])
dup_df

    0
a   5
b   5
c   6
d   7
e   8
f   8
g   7
h  12
i  25
j  55
k  25

- ### `.aggregate()`
- ### `.filter()`
- ### `.transform()`
- ### `.apply()`
- ### `.pivot_table()`

In [623]:
df6 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df6

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

### ``.aggregate()``

### ``.filter()``

In [636]:
df7 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df7

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [637]:
df7.groups.unique()

array(['A', 'B', 'C'], dtype=object)

In [638]:
df7.groupby("groups").std()

             var1        var2
groups
A        8.485281  114.551299
B        8.485281  100.409163
C       46.669048  449.719913

In [647]:
def filter_func(x):
    return x["var1"].mean() > 19

In [3]:
# returns the rows that meet the condition, as a DataFrame

In [649]:
df7.groupby("groups").sum()

        var1  var2
groups
A         32   362
B         34   364
C        132  1302

### ``.transform()``

In [651]:
df8 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df8

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [652]:
df8["var1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: var1, dtype: int64

In [653]:
df_a = df8.iloc[:,1:3]

In [654]:
df_a

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [4]:
# returns A DataFrame that must have the same length as self. Standardization(mean 0 std 1) Normalization (0-1)

In [658]:
df_a.iloc[0,0]

10

In [659]:
(df_a.iloc[0,0] - df_a.var1.mean()) / df_a.var1.std()

-0.6878708952377661

In [660]:
10

10

In [661]:
df_a

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [663]:
np.log(df_a.var1)

0    2.302585
1    3.135494
2    3.496508
3    3.091042
4    2.397895
5    4.595120
Name: var1, dtype: float64

### ``.apply()``

In [664]:
df9 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df9

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [666]:
df9.var1.sum()

198

In [667]:
# sum() functions works with putting + sign between each element of an iterable object

df9.groups.sum()

'ABCABC'

In [668]:
# It gives an error due to the non-numeric column : "groups"

# df4.apply(np.median)

In [669]:
df_numeric = df9.iloc[:,1:3]

In [670]:
df_numeric

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [675]:
df9.groupby("groups").mean()

        var1  var2
groups
A         16   181
B         17   182
C         66   651

In [676]:
# Applying Functions using df6

df10 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

df10

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [678]:
def squared(x):
    return x**2

### `df.transform() vs df.apply()`

In [681]:
df10

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
#returns the length of each variable (columns) separately

In [685]:
df1 = pd.DataFrame([["a", 9, 25]] * 4, columns=["grp", 'P', 'Q'])
df2 = pd.DataFrame([["b", 9, 25]] * 3, columns=["grp", 'P', 'Q'])
df3 = pd.concat([df1, df2], ignore_index=True)
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [6]:
# returns a DataFrame that does not have the same length as itself

In [690]:
df3.groupby("grp").sum()

      P    Q
grp
a    36  100
b    27   75

In [695]:
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [696]:
def squared(x,y):
    return (x**2,y**2)

In [698]:
df3

  grp  P   Q          R
0   a  9  25  (81, 625)
1   a  9  25  (81, 625)
2   a  9  25  (81, 625)
3   a  9  25  (81, 625)
4   b  9  25  (81, 625)
5   b  9  25  (81, 625)
6   b  9  25  (81, 625)

### Pivot Tables

In [332]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [337]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [338]:
titanic.groupby(["sex","class"])[["survived"]].mean()

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [342]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

### Using pivot table

- Create a spreadsheet-style pivot table as a ``DataFrame``.

In [323]:
titanic.age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [326]:
data = {'A':['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
       'B':['one', 'one', 'two', 'two', 'one', 'one'],
       'C':['x', 'y', 'x', 'y', 'x', 'y'],
       'D':[1, 3, 2, 5, 4, 1]}

df5 = pd.DataFrame(data)

df5

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

# The End of the Session - 5